{
  "c_at_1pct": "Percentage of total achievable decarbonization (i.e., the maximum reduction attainable up to 5% TE) that is already reached at 1% tracking error.",
  "alignment": "Spearman rank correlation between benchmark weights and benchmark carbon contributions.",
  "te_50pct": "Tracking-error level required to achieve 50% of a sector’s maximum decarbonization.",

  "avg_bandwidth": "Average ε-Bandwidth:\nAverage width of allowable weight intervals for stocks that still satisfy TE and carbon constraints. Higher = more portfolio flexibility.",
  "median_bandwidth": "Median ε-Bandwidth:\nMedian width of the ε-bands across all stocks. A central measure of portfolio flexibility.",
  "max_bandwidth": "Max ε-Bandwidth:\nMaximum allowable variation range for any individual stock’s weight. Higher = at least one stock has substantial flexibility.",
  "l2_lower_bound": "L2 Lower Bound (Same Objective):\nMinimum L₂ distance between the optimal portfolio and any other equally-optimal portfolio that respects constraints. Higher = more flexibility.",
  "annualized_te": "Standard deviation of daily active returns over the out-of-sample window (next three months) then annualized.",
  "annualized_volatility":  "Daily volatility of the sector benchmark index, computed from out-of-sample (next three months) daily returns and then annualized.",
  "daily_te": "Standard deviation of daily active returns over the out-of-sample window (next three months). Lower tracking error = sector more robust to estimation uncertainty.",
  "daily_volatility": "Daily volatility of the sector benchmark index, computed from out-of-sample (next three months) daily returns. Lower volatility = sector inherently less risky.",
  "robustness_score": "Robustness Score (0–1):\nNormalized measure of stability. Higher = more robust relative to other sectors within the same period.",

  "median_turnover": "Median Turnover (%):\nMedian turnover required to adjust to perturbed optimal portfolios. Higher = more sensitivity to input changes.",
  "median_cosine": "Median Cosine Similarity:\nCosine similarity measures alignment between baseline and perturbed portfolios. Higher values = less sensitivity.",
  "p95_carbon_loss": "P95 Carbon Loss (pp):\n95th percentile loss in carbon reduction performance under noisy inputs. Higher = more sensitivity in climate outcome.",
  "sensitivity_score": "Sensitivity Score (0–1):\nCombined normalized score (inverted) capturing composition and outcome sensitivity. Higher = more stable, less sensitive.",

  "room_norm": "Room for Maneuver (normalized 0–1): Position of the sector on the Room-for-Maneuver scale after global min–max normalization across sectors.",
  "flex_norm": "Flexibility (normalized 0–1): Position of the sector on the Flexibility scale after global min–max normalization across sectors.",
  "sens_norm": "Sensitivity (normalized 0–1): Position of the sector on the Sensitivity scale after global min–max normalization across sectors. Higher = less sensitive.",
  "robust_norm": "Robustness (normalized 0–1): Position of the sector on the Robustness scale after global min–max normalization across sectors.",
  "dri": "Decarbonization Readiness Index (DRI): Simple average of the four normalized dimensions (Room, Flexibility, Sensitivity, Robustness). Higher = greater overall readiness."
}
